# Routing Information Protocol (RIP) — Theory & Configuration

## Overview
Routing Information Protocol (**RIP**) is one of the oldest **industry-standard distance vector** Interior Gateway Protocols (IGPs).  
It uses a **routing-by-rumor** logic to learn and share routes between routers.

- **Metric**: Hop count (1 router = 1 hop; bandwidth is ignored)
- **Maximum hop count**: 15 (anything more is considered unreachable)
- **Versions**:
  - **RIPv1**: IPv4, classful
  - **RIPv2**: IPv4, classless
  - **RIPng**: IPv6
- **Message types**:
  - **Request**: Ask neighbor routers for their routing table
  - **Response**: Send the local routing table to neighbors
- **Update frequency**: Every 30 seconds

---

## RIP Versions

### RIPv1 (Classful)
- Advertises **only classful addresses** (A, B, C)
- Does **not** support **VLSM** or **CIDR**
- Does **not** include subnet mask in advertisements
- Broadcasts updates to **255.255.255.255**

**Examples:**
| IP Address        | Advertised As     |
|-------------------|-------------------|
| `10.1.1.0/24`     | `10.0.0.0` (/8)   |
| `172.16.192.0/18` | `172.16.0.0` (/16)|
| `192.168.1.4/30`  | `192.168.1.0` (/24)|

---

### RIPv2 (Classless)
- Supports **VLSM** and **CIDR**
- Includes subnet mask in advertisements
- Multicasts updates to **224.0.0.9**

**Note**:  
- **Broadcast**: Delivered to all devices on the local network  
- **Multicast**: Delivered only to devices in a specific multicast group  

---

## Basic RIP Configuration

```
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 10.0.0.0
R1(config-router)#network 172.16.0.0
```

- The `network` command is **classful** (auto-converts to classful networks).
- No need to enter subnet mask.
- OSPF and EIGRP use the `network` command similarly.

---

## How the `network` Command Works
The `network` command tells the router to:
1. Find interfaces with an IP address in the specified range.
2. Activate RIP on those interfaces.
3. Form adjacencies with connected RIP neighbors.
4. Advertise **the interface's prefix** (not the `network` command prefix).

**Example 1 — Class A Network:**
```
R1(config-router)#network 10.0.0.0
```
- Matches **10.0.0.0/8** → activates RIP on interfaces like `10.0.12.1`, `10.0.13.1`.
- Forms adjacencies with neighbors (e.g., R2, R3).
- Advertises `10.0.12.0/30` and `10.0.13.0/30`.

**Example 2 — Class B Network:**
```
R1(config-router)#network 172.16.0.0
```
- Matches **172.16.0.0/16** → activates RIP on `172.16.1.14`.
- No neighbors found on that interface → still sends advertisements unnecessarily.

---

## Passive Interface

```
R1(config-router)#passive-interface g2/0
```
- Stops sending RIP updates on the interface.
- Still advertises the network to other RIP neighbors.
- Use on interfaces **without** RIP neighbors.
- Works the same in **EIGRP** and **OSPF**.

---

## Default Route Advertisement

```
R1(config-router)#default-information originate
```
- Advertises a default route to all RIP neighbors.

---

## Useful RIP Commands

| Command | Purpose |
|---------|---------|
| `show ip protocols` | Displays routing protocol details |
| `maximum-paths [n]` | Adjusts number of equal-cost load-balanced paths |
| `distance [AD]` | Changes the Administrative Distance for RIP |

---

## Summary

| Feature             | RIPv1              | RIPv2              | RIPng           |
|--------------------|-------------------|-------------------|----------------|
| IP Version         | IPv4              | IPv4              | IPv6           |
| Classless Support  | No                | Yes               | Yes            |
| VLSM / CIDR        | No                | Yes               | Yes            |
| Update Method      | Broadcast         | Multicast         | Multicast      |
| Subnet Mask Info   | No                | Yes               | Yes            |
| Max Hop Count      | 15                | 15                | 15             |
| Metric             | Hop Count         | Hop Count         | Hop Count      |


# Enhanced Interior Gateway Routing Protocol (EIGRP) — Theory & Configuration

## Overview
Enhanced Interior Gateway Routing Protocol (**EIGRP**) is an **advanced hybrid distance vector** routing protocol.

- Originally Cisco proprietary, now openly published for multi-vendor support.
- Faster convergence compared to RIP.
- No **15 hop-count limit** (unlike RIP).
- Uses multicast address **224.0.0.10**.
- Only IGP that supports **unequal-cost load balancing**.
- By default, performs ECMP (Equal-Cost Multi-Path) load balancing over **4 paths**.

---

## Basic EIGRP Configuration

```
R1(config)#router eigrp 1
R1(config-router)#no auto-summary
R1(config-router)#passive-interface g2/0
R1(config-router)#network 10.0.0.0
R1(config-router)#network 172.16.0.0 0.0.0.15
```

- **AS Number**: Must match between routers to form adjacency.
- `no auto-summary`: Disable auto-summarization (enabled by default on some IOS versions).
- EIGRP uses a **wildcard mask** instead of a subnet mask.

---

## Wildcard Masks

A **wildcard mask** is the inverse of a subnet mask:  
- All **1s** in the subnet mask become **0s** in the wildcard mask.
- All **0s** in the subnet mask become **1s** in the wildcard mask.

**Example**:  
Subnet Mask: `255.255.255.240`  
Binary: `11111111.11111111.11111111.11110000`  
Wildcard Mask: `0.0.0.15`  
Binary: `00000000.00000000.00000000.00001111`

---

## Router ID Priority
1. Manually configured Router ID.
2. Highest IP address on a loopback interface.
3. Highest IP address on a physical interface.

**Example**:
```
R1(config-router)#eigrp router-id 1.1.1.1
```

---

## Useful Commands

| Command | Purpose |
|---------|---------|
| `maximum-paths [n]` | Adjusts equal-cost load-balanced paths |
| `distance [AD]` | Changes Administrative Distance |
| `show ip eigrp neighbors` | Displays EIGRP neighbors |
| `show ip route eigrp` | Shows EIGRP learned routes |

---

## Summary

| Feature             | EIGRP             | RIP               |
|--------------------|-------------------|-------------------|
| Type               | Hybrid Distance Vector | Distance Vector  |
| Max Hop Count      | 224 (practical limit)   | 15               |
| Load Balancing     | Equal & Unequal    | Equal only        |
| Convergence Speed  | Fast               | Slow              |
| Multicast Address  | 224.0.0.10         | 224.0.0.9 (RIPv2) |
| Metric             | Composite (Bandwidth, Delay, Reliability, MTU, Load) | Hop Count |
