# OSPF Part 2 – Cost & Neighbors

## OSPF Cost

- OSPF uses **cost** as its metric.
- Cost is based on the bandwidth (speed) of the interface.
- Formula:  

  ```
  OSPF Cost = Reference Bandwidth / Interface Bandwidth
  ```

- By default, the **reference bandwidth** = 100 Mbps.

### Examples
- Reference 100 Mbps / Interface 10 Mbps → Cost = 10  
- Reference 100 Mbps / Interface 100 Mbps → Cost = 1  
- Reference 100 Mbps / Interface 1000 Mbps → Cost = 1 (anything less than 1 becomes 1)  
- This means FastEthernet, Gigabit Ethernet, and 10Gig Ethernet all have cost = 1 by default.  

---

### Changing Reference Bandwidth
- Command:  
  ```
  R1(config-router)# auto-cost reference-bandwidth <Mbps>
  ```
- Example:  
  - 100000 / 100 = Cost 1000 (FastEthernet)  
  - 100000 / 1000 = Cost 100 (GigabitEthernet)  

- **Best Practice:**  
  - Use a reference bandwidth higher than your fastest link.  
  - Configure the **same reference bandwidth on all routers**.  

---

### Calculating Total OSPF Cost
- The cost to reach a destination is the **sum of all outgoing interface costs**.  
- Example:  
  - R1 → R4 path:  
    - R1 G0/0 = 100  
    - R2 G1/0 = 100  
    - R4 G1/0 = 100  
    - **Total = 300**

- Loopback interfaces always have a **cost of 1**.  
- Example: Cost from R1 to R2’s loopback (2.2.2.2):  
  - R1 G1/0 = 100 + R2 L0 = 1 → **Total = 101**

---

### Changing Interface Cost
1. **Manually configure cost**  
   ```
   R1(config-if)# ip ospf cost <1–65535>
   ```
   Example:  
   ```
   R1(config-if)# ip ospf cost 10000
   ```

2. **Change interface bandwidth (not recommended for OSPF cost)**  
   ```
   R1(config-if)# bandwidth <kilobits>
   ```

   > Note: Changing bandwidth does not change actual speed, only metric calculation.  
   > Use this mainly for EIGRP or QoS, not OSPF.

3. **Change reference bandwidth** (recommended).  

---

### Summary – 3 Ways to Modify OSPF Cost
1. Change reference bandwidth  
   ```
   R1(config-router)# auto-cost reference-bandwidth <Mbps>
   ```
2. Manually set cost  
   ```
   R1(config-if)# ip ospf cost <value>
   ```
3. Change interface bandwidth  
   ```
   R1(config-if)# bandwidth <kbps>
   ```

---

## OSPF Neighbors

### Neighbor Formation
- Routers must form a **neighbor relationship** to exchange LSAs.  
- OSPF uses **Hello messages** to find and maintain neighbors.  
- Default hello timer (Ethernet) = 10 sec.  
- Dead timer = 40 sec (if no Hello received, neighbor is removed).  
- Hello packets are multicast to **224.0.0.5**.  
- OSPF protocol number = **89** in IP header.  

---

### Neighbor States
1. **Down State**  
   - Router sends Hello but has no neighbors yet.  

2. **Init State**  
   - Router received Hello, but its own RID is not seen in packet.  

3. **2-Way State**  
   - Both routers see each other’s RID in Hello.  
   - They are now OSPF neighbors.  
   - DR/BDR election may happen here.  

4. **Exstart State**  
   - Routers decide Master/Slave based on higher RID.  
   - Master starts database exchange.  

5. **Exchange State**  
   - Routers exchange **DBD (Database Description)** packets.  

6. **Loading State**  
   - Routers send **LSR (Link State Request)** for missing LSAs.  
   - Neighbor replies with **LSU (Link State Update)**.  
   - LSAs are acknowledged with **LSAck**.  

7. **Full State**  
   - Routers have the same LSDB.  
   - They keep exchanging Hello packets to maintain adjacency.  

---

## OSPF Configuration & Commands

### Activate OSPF on Interfaces
```
R1(config)# int g0/0
R1(config-if)# ip ospf 1 area 0
R1(config)# int g1/0
R1(config-if)# ip ospf 1 area 0
R1(config)# int g2/0
R1(config-if)# ip ospf 1 area 0
R1(config)# int lo0
R1(config-if)# ip ospf 1 area 0
```

### Passive Interfaces
- Make all interfaces passive (no OSPF updates):  
  ```
  R1(config-router)# passive-interface default
  ```
- Reactivate specific interfaces:  
  ```
  R1(config-router)# no passive-interface g0/0
  R1(config-router)# no passive-interface g1/0
  ```

---

### Show Commands
- Show OSPF neighbors:  
  ```
  R1# show ip ospf neighbor
  ```

- Show OSPF interface:  
  ```
  R1# show ip ospf interface g0/0
  ```

- Show OSPF interfaces summary:  
  ```
  R3# show ip ospf interface brief
  ```

---

## OSPF Steps (Summary)
1. Become neighbors.  
2. Exchange LSAs.  
3. Calculate best routes and install in routing table.  
